app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('Rails Tutorial', 'example@railstutorial.org', '2011-08-31 21:07:48.866247', '2011-08-31 21:07:48.866247', '037cd22f685d66799f7e5a2c42d8bae5dbbe054eeb4036e37977bdb3a34557ef', '32a48f7d219847c8e174446df20961b33b5037ae6e706b12c483444372f483fb')
---
  def create
    @user = User.new(params[:user])
    if @user.save